
## Plan Result (terraform/mgmt/vpc)

[CI link](https://github.com/mileslee-nsuslab/tfaction-example/actions/runs/6008591663)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 3 to change, 5 to destroy.</code></pre>

* Update
  * module.vpc.aws_eip.nat[0]
  * module.vpc.aws_route.private_nat_gateway[0]
  * module.vpc.aws_route_table.private[0]
* Replace
  * module.vpc.aws_nat_gateway.this[0]
  * module.vpc.aws_route_table_association.private[0]
  * module.vpc.aws_route_table_association.public[0]
  * module.vpc.aws_subnet.private[0]
  * module.vpc.aws_subnet.public[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-02ef315b3aada2768"
      ~ tags                 = {
            "Environment" = "prod"
          ~ "Name"        = "my-vpc-us-east-1a" -> "my-vpc-eu-west-1a"
            "Terraform"   = "true"
        }
      ~ tags_all             = {
          ~ "Name"        = "my-vpc-us-east-1a" -> "my-vpc-eu-west-1a"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] must be replaced
-/+ resource "aws_nat_gateway" "this" {
      ~ association_id                     = "eipassoc-028e035923218e763" -> (known after apply)
      ~ id                                 = "nat-041693a73ccbebefa" -> (known after apply)
      ~ network_interface_id               = "eni-07248ff62a7308bdb" -> (known after apply)
      ~ private_ip                         = "10.0.101.136" -> (known after apply)
      ~ public_ip                          = "54.234.22.64" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-041d5cd12b41e3647" # forces replacement -> (known after apply) # forces replacement
      ~ tags                               = {
            "Environment" = "prod"
          ~ "Name"        = "my-vpc-us-east-1a" -> "my-vpc-eu-west-1a"
            "Terraform"   = "true"
        }
      ~ tags_all                           = {
          ~ "Name"        = "my-vpc-us-east-1a" -> "my-vpc-eu-west-1a"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                     = "r-rtb-089883fb520b48fff1080289494"
      ~ nat_gateway_id         = "nat-041693a73ccbebefa" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-089883fb520b48fff"
      ~ tags             = {
            "Environment" = "prod"
          ~ "Name"        = "my-vpc-private-us-east-1a" -> "my-vpc-private-eu-west-1a"
            "Terraform"   = "true"
        }
      ~ tags_all         = {
          ~ "Name"        = "my-vpc-private-us-east-1a" -> "my-vpc-private-eu-west-1a"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private[0] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-0d562e6db7a583d89" -> (known after apply)
      ~ subnet_id      = "subnet-01843be32b478e2a8" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.public[0] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-0e822643a9f936153" -> (known after apply)
      ~ subnet_id      = "subnet-041d5cd12b41e3647" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_subnet.private[0] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:651482608654:subnet/subnet-01843be32b478e2a8" -> (known after apply)
      ~ availability_zone                              = "us-east-1a" -> "eu-west-1a" # forces replacement
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-01843be32b478e2a8" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "651482608654" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
            "Environment" = "prod"
          ~ "Name"        = "my-vpc-private-us-east-1a" -> "my-vpc-private-eu-west-1a"
            "Terraform"   = "true"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "my-vpc-private-us-east-1a" -> "my-vpc-private-eu-west-1a"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:651482608654:subnet/subnet-041d5cd12b41e3647" -> (known after apply)
      ~ availability_zone                              = "us-east-1a" -> "eu-west-1a" # forces replacement
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-041d5cd12b41e3647" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "651482608654" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
            "Environment" = "prod"
          ~ "Name"        = "my-vpc-public-us-east-1a" -> "my-vpc-public-eu-west-1a"
            "Terraform"   = "true"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "my-vpc-public-us-east-1a" -> "my-vpc-public-eu-west-1a"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

Plan: 5 to add, 3 to change, 5 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":55,"Program":"tfcmt","SHA1":"82e43b311b7ff0b6c2674d0139233e600ce74e7c","Target":"terraform/mgmt/vpc","Vars":{},"WorkflowName":"test"} -->